app/views/orders/index.html.erb

      <!--CUSTOMER NAME-->
      <div class="col-3 pl-4"><%= Account.find_by_id(order.account_id).name %></div>
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? ORDER BY "accounts"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]