app/controllers/accounts_controller.rb

  def index
    @accounts = Account.all.page(params[:page]).per(5)
    @roles = Role.all
---
SELECT  "accounts".* FROM "accounts" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "accounts"
SELECT "roles".* FROM "roles"

  def edit
    @user = Account.find_by_id(current_account.id)
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? ORDER BY "accounts"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]