app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT "images".* FROM "images" WHERE "images"."category_id" IN (1, 2)
SELECT COUNT(*) FROM "categories"
---
  def index

    @categories = Category.all.includes(:images).page(params[:page]).per(5)