app/controllers/orders_controller.rb

  def index
    @orders = Order.all.page(params[:page]).per(5)
---
SELECT  "orders".* FROM "orders" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "orders"