app/controllers/products_controller.rb

  def home
    @products = Product.all.size
    @orders = Order.all
    @revenue = 0
    @orders.each do |p|
      @revenue += p.total_price
    end
    @users = Account.all.size

    id = OrderProduct.order("quantity DESC").take(3).pluck(:product_id).uniq

    @best_products = Product.where(id: id)
    # @best_products.each do |pid|
    #   @p = OrderProduct.where(product_id: pid)
    #   q = 0
    #   @p.each do |i|
    #     q += i.quantity
    #   end
    #   puts q
    # end

    # vip customer
    money = 0
    vip_id = Order.order("total_price DESC").take(3).pluck(:account_id).uniq
    @vip_customers = Account.where(id: vip_id)
---
SELECT COUNT(*) FROM "products"
SELECT "orders".* FROM "orders"
SELECT COUNT(*) FROM "accounts"
SELECT "products".* FROM "products" WHERE "products"."id" = 1
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? ORDER BY "accounts"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def index
    @products = Product.all.page(params[:page]).per(5)
    @categories = Category.all
---
SELECT  "products".* FROM "products" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"
SELECT "categories".* FROM "categories"