app/views/categories/index.html.erb

SELECT "images".* FROM "images" WHERE "images"."category_id" IN (1, 2)
---
      <!--IMG-->
      <div class="col-2"><img src="<%= category.images.first.url %>" alt="" class="img-index-categories"></div>

SELECT COUNT("products"."name") FROM "products" WHERE "products"."category_id" = ?  [["category_id", 1]]
---
      <div class="col-2 text-center">
        <%= Product.where(category_id: category.id).count(:name) %>