app/views/products/home.html.erb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_products".* FROM "order_products" WHERE "order_products"."product_id" = 1
---
        <!--CATEGORY-->
        <div class="col-3"><%= Category.find_by_id(pid.category_id).name %></div>
        <!--SOLD-->
        <% @p = OrderProduct.where(product_id: pid) %>

SELECT "orders".* FROM "orders" WHERE "orders"."account_id" = ?  [["account_id", 2]]
---
          <!--SOLD-->
          <% @p = Order.where(account_id: item.id) %>