app/views/products/index.html.erb

            <!--Category-->
            <div class="col-2"><%= Category.find(product.category_id).name %></div>
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]