app/views/accounts/edit.html.erb

SELECT  "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <div class="col-4">
          <%= form.text_field :role_id, class: "input-filter-index-category", value: Role.find_by_id(@user.role_id).name.upcase, disabled:true %>