app/views/accounts/index.html.erb

SELECT  "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <!--ROLE-->
      <div class="col-1 px-1"><%= Role.find(account.role_id).name.upcase %></div>